span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
/********************************************************************
* FileName:		MRF24J40.c
* Dependencies:    
* Processor:	PIC18, PIC24F, PIC24H, dsPIC30, dsPIC33
*               tested with 18F4620, dsPIC33FJ256GP710	
* Hardware:		PICDEM Z, Explorer 16, PIC18 Explorer
* Complier:     Microchip C18 v3.04 or higher
*				Microchip C30 v2.03 or higher	
*               Microchip C32 v1.02 or higher	
* Company:		Microchip Technology, Inc.
*
* Copyright and Disclaimer Notice
*
* Copyright © 2007-2009 Microchip Technology Inc.  All rights reserved.
*
* Microchip licenses to you the right to use, modify, copy and distribute 
* Software only when embedded on a Microchip microcontroller or digital 
* signal controller and used with a Microchip radio frequency transceiver, 
* which are integrated into your product or third party product (pursuant 
* to the terms in the accompanying license agreement).   
*
* You should refer to the license agreement accompanying this Software for 
* additional information regarding your rights and obligations.
*
* SOFTWARE AND DOCUMENTATION ARE PROVIDED “AS IS” WITHOUT WARRANTY OF ANY 
* KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY 
* WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A 
* PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE 
* LIABLE OR OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, 
* CONTRIBUTION, BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE THEORY ANY 
* DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT LIMITED TO 
* ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, 
* LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, 
* TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES (INCLUDING BUT 
* NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
*
*********************************************************************
* File Description:
*
*  This file provides transceiver driver functionality for MRF24J40 
*  IEEE 802.15.4 compatible 2.4GHz transceiver. The transceiver
*  driver interfaces are based on Microchip MAC strategy. The 
*  transceiver driver interfaces works with all Microchip wireless 
*  protocols
*
* Change History:
*  Rev   Date         Author    Description
*  1.0   2/15/2009    yfy       Initial revision
*  2.0   4/15/2009    yfy       MiMAC and MiApp revision
*  2.1   6/20/2009    yfy       Add LCD support
*  2.1a  09/04/09     dw        Modified for RTOS demo
*                               a semaphore has been added to the
*                               RF interrupt handler to indicate to
*                               the MiWi task when a packet _may_ need
*                               processing                             
********************************************************************/
#include "SystemProfile.h"

#include "FreeRTOS.h"
#include "semphr.h"

// semaphore used to wake the MiWitask up because some activity
// has occured in the stack, this allows that task to spend longer
// blocked whilst still responding quickly to arriving messages
extern xSemaphoreHandle hMiWiSemaphore;

#if defined(MRF24J40)

    #include "Compiler.h"
    #include "GenericTypeDefs.h"
    #include "Transceivers\MCHP_MAC.h"
    #include "Common\MSPI.h"
    #include "Transceivers\Transceivers.h"
    #include "Common\Console.h"
    #include "Common\SymbolTime.h"
    
    /************************ VARIABLES ********************************/
    MACINIT_PARAM   MACInitParams;
    
    #if defined(__18CXX)
        #define MIPS    (CLOCK_FREQ/4000000)
    #elif defined(__PIC24F__) || defined(__PIC24H__) || defined(__dsPIC33F__)
        #define MIPS    (CLOCK_FREQ/2000000)
    #elif defined(__PIC32MX__)
        #define MIPS    (CLOCK_FREQ/1000000)   // PIC32 has various execution timing. Here assumes the best situation
    #else
        #error "Unsupported MCU family. Please contact Microchip Technology for more support information"
    #endif
    
    #define FAILURE_COUNTER ((WORD)0x20 * MIPS)
    
    #ifdef ENABLE_SECURITY
        #if defined(__18CXX)
            #pragma romdata securityKey = 0x2E
        #endif
            ROM unsigned char mySecurityKey[16] = {SECURITY_KEY_00, SECURITY_KEY_01, SECURITY_KEY_02, SECURITY_KEY_03, SECURITY_KEY_04,
    	        SECURITY_KEY_05, SECURITY_KEY_06, SECURITY_KEY_07, SECURITY_KEY_08, SECURITY_KEY_09, SECURITY_KEY_10, SECURITY_KEY_11, 
    	        SECURITY_KEY_12, SECURITY_KEY_13, SECURITY_KEY_14, SECURITY_KEY_15}; // The 16-byte security key used in the 
    	                                                                             // security module. 
        #if defined(__18CXX)    	                                                                             
            #pragma romdata
        #endif
        
        ROM unsigned char mySecurityLevel = SECURITY_LEVEL;             // The security level used in the security module. 
                                                                        // The security level is defined in IEEE 802.15.4 specification
                                                                        // It can be from 1 to 7.
        ROM unsigned char myKeySequenceNumber = KEY_SEQUENCE_NUMBER;    // The sequence number of security key. Used to identify
                                                                        // the security key
    	
    	DWORD_VAL OutgoingFrameCounter;     
        
        BYTE tmpSourceLongAddress[MY_ADDRESS_LENGTH];
        DWORD_VAL tmpFrameCounter;  
        
        #include "WirelessProtocols\MCHP_API.h"          
    #endif	
    
    #if defined(__18CXX)
        #pragma udata MAC_RX_BUFF = 0x400
    #endif
    BYTE RxBuffer[RX_PACKET_SIZE]; 
    #if defined(__18CXX)
        #pragma udata
    #endif
    
    BYTE IEEESeqNum;
    volatile WORD failureCounter = 0;
    BYTE MACCurrentChannel;
    
    WORD_VAL MAC_PANID;
    WORD_VAL myNetworkAddress;
    TICK t1, t2;

    volatile MRF24J40_STATUS MRF24J40Status;
    
    void SPIPut(BYTE v);
    BYTE SPIGet(void);
    
    /*********************************************************************
     * void PHYSetLongRAMAddr(INPUT WORD address, INPUT BYTE value)
     *
     * Overview:        This function writes a value to a LONG RAM address
     *
     * PreCondition:    Communication port to the MRF24J40 initialized
     *
     * Input:           address - the address of the LONG RAM address
     *                      that you want to write to
     *                  value   - the value that you want to write to
     *                      that register
     *
     * Output:          None
     *
     * Side Effects:    The register value is changed
     *                  Interrupt from radio is turned off before accessing
     *                  the SPI and turned back on after accessing the SPI
     *
     ********************************************************************/
    void PHYSetLongRAMAddr(INPUT WORD address, INPUT BYTE value)
    {
        volatile BYTE tmpRFIE = RFIE;
        
        RFIE = 0;
        PHY_CS = 0;
        SPIPut((((BYTE)(address>>3))&0x7F)|0x80);
        SPIPut((((BYTE)(address<<5))&0xE0)|0x10);
        SPIPut(value);
        PHY_CS = 1;
        RFIE = tmpRFIE;
    }
    
    /*********************************************************************
     * void PHYSetShortRAMAddr(INPUT BYTE address, INPUT BYTE value)
     *
     * Overview:        This function writes a value to a short RAM address
     *
     * PreCondition:    Communication port to the MRF24J40 initialized
     *
     * Input:           address - the address of the short RAM address
     *                      that you want to write to.  Should use the
     *                      WRITE_ThisAddress definition in the MRF24J40 
     *                      include file.
     *                  value   - the value that you want to write to
     *                      that register
     *
     * Output:          None
     *
     * Side Effects:    The register value is changed
     *                  Interrupt from radio is turned off before accessing
     *                  the SPI and turned back on after accessing the SPI
     *
     ********************************************************************/
    void PHYSetShortRAMAddr(INPUT BYTE address, INPUT BYTE value)
    {
        volatile BYTE tmpRFIE = RFIE;
        
        RFIE = 0;
        PHY_CS = 0;     
        SPIPut(address);
        SPIPut(value);
        PHY_CS = 1;
        RFIE = tmpRFIE;
    }
    
    /*********************************************************************
     * BYTE PHYGetShortRAMAddr(INPUT BYTE address)
     *
     * Overview:        This function reads a value from a short RAM address
     *
     * PreCondition:    Communication port to the MRF24J40 initialized
     *
     * Input:           address - the address of the short RAM address
     *                      that you want to read from.  Should use the
     *                      READ_ThisAddress definition in the MRF24J40 
     *                      include file.
     *
     * Output:          None
     *
     * Side Effects:    Interrupt from radio is turned off before accessing
     *                  the SPI and turned back on after accessing the SPI
     *
     ********************************************************************/
    BYTE PHYGetShortRAMAddr(INPUT BYTE address)
    {
        BYTE toReturn;
        volatile BYTE tmpRFIE = RFIE;
        
        RFIE = 0;
        PHY_CS = 0;
        SPIPut(address);
        toReturn = SPIGet();
        PHY_CS = 1;
        RFIE = tmpRFIE;
        
