span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
        return toReturn;
    }
    
    /*********************************************************************
     * BYTE PHYGetLongRAMAddr(INPUT WORD address)
     *
     * Overview:        This function reads a value from a long RAM address
     *
     * PreCondition:    Communication port to the MRF24J40 initialized
     *
     * Input:           address - the address of the long RAM address
     *                      that you want to read from.  
     *
     * Output:          the value read from the specified Long register
     *
     * Side Effects:    Interrupt from radio is turned off before accessing
     *                  the SPI and turned back on after accessing the SPI
     *
     ********************************************************************/
    BYTE PHYGetLongRAMAddr(INPUT WORD address)
    {
        BYTE toReturn;
        volatile BYTE tmpRFIE = RFIE;
        
        RFIE = 0;
        PHY_CS = 0;
        SPIPut(((address>>3)&0x7F)|0x80);
        SPIPut(((address<<5)&0xE0));
        toReturn = SPIGet();
        PHY_CS = 1;
        RFIE = tmpRFIE;
        
        return toReturn;
    }


    /*********************************************************************
     * void InitMRF24J40(void)
     *
     * Overview:        This function initialize MRF24J40 transceiver
     *
     * PreCondition:    Communication port to the MRF24J40 initialized
     *
     * Input:           none
     *
     * Output:          none
     *
     * Side Effects:    MRF24J40 transceiver is initialized
     *
     ********************************************************************/
    void InitMRF24J40(void)
    {
        BYTE i;
        WORD j;
        
        // first perform a hardware reset
        PHY_RESETn = 0;
        for(j=0;j<(WORD)300;j++){}
    
        PHY_RESETn = 1;
        for(j=0;j<(WORD)300;j++){}
      
        /* do a soft reset */
        PHYSetShortRAMAddr(WRITE_SOFTRST,0x07);
        do
        {
            i = PHYGetShortRAMAddr(READ_SOFTRST);
        }
        while((i&0x07) != (BYTE)0x00);   
    
        for(j=0;j<(WORD)1000;j++){}
     
        /* flush the RX fifo */
        PHYSetShortRAMAddr(WRITE_RXFLUSH,0x01);
        
        /* Program the short MAC Address, 0xffff */
        PHYSetShortRAMAddr(WRITE_SADRL,0xFF);
        PHYSetShortRAMAddr(WRITE_SADRH,0xFF);
        PHYSetShortRAMAddr(WRITE_PANIDL,0xFF);
        PHYSetShortRAMAddr(WRITE_PANIDH,0xFF);
        
        /* Program Long MAC Address*/
        for(i=0;i<(BYTE)8;i++)
        {
            PHYSetShortRAMAddr(WRITE_EADR0+i*2,MACInitParams.PAddress[i]);
        }
        
        /* select the correct channel */
        PHYSetLongRAMAddr(RFCTRL0,0x03);
        PHYSetLongRAMAddr(RFCTRL1,0x02);    
        
        /* setup */
        PHYSetLongRAMAddr(RFCTRL2,0x80);
        
        #if defined(ENABLE_PA_LNA) && defined(MRF24J40MB)
            // There are special MRF24J40 transceiver output power
            // setting for Microchip MRF24J40MB module.
            #if APPLICATION_SITE == EUROPE
                // MRF24J40 output power set to be -14.9dB
                PHYSetLongRAMAddr(RFCTRL3, 0x70);
            #else
                // MRF24J40 output power set to be -1.9dB
                PHYSetLongRAMAddr(RFCTRL3, 0x18);
            #endif
        #else
            // power level to be 0dBms
            PHYSetLongRAMAddr(RFCTRL3,0x00);
        #endif
        
        /* program RSSI ADC with 2.5 MHz clock */
        PHYSetLongRAMAddr(RFCTRL6,0x90);
        
        PHYSetLongRAMAddr(RFCTRL7,0x80);
        
        PHYSetLongRAMAddr(RFCTRL8,0x10); 
        
        PHYSetLongRAMAddr(SCLKDIV, 0x01);
    
        /* Program CCA mode using RSSI */
        PHYSetShortRAMAddr(WRITE_BBREG2,0x80);
        /* Enable the packet RSSI */
        PHYSetShortRAMAddr(WRITE_BBREG6,0x40);
        /* Program CCA, RSSI threshold values */
        PHYSetShortRAMAddr(WRITE_RSSITHCCA,0x60);
    
        #if defined(ENABLE_PA_LNA)

            PHYSetLongRAMAddr(TESTMODE, 0x0F);
        
        #endif
        
        PHYSetShortRAMAddr(WRITE_FFOEN, 0x98);
        PHYSetShortRAMAddr(WRITE_TXPEMISP, 0x95);
    
        // wait until the MRF24J40 in receive mode
        do
        {
            i = PHYGetLongRAMAddr(RFSTATE);
        }
        while((i&0xA0) != 0xA0);

        PHYSetShortRAMAddr(WRITE_INTMSK,0xE6);
    
        #ifdef ENABLE_INDIRECT_MESSAGE
            PHYSetShortRAMAddr(WRITE_ACKTMOUT, 0xB9);
        #endif
        
        // Make RF communication stable under extreme temperatures
        PHYSetLongRAMAddr(RFCTRL0, 0x03);
        PHYSetLongRAMAddr(RFCTRL1, 0x02);
        
        MiMAC_SetChannel(MACCurrentChannel, 0);
                    
        // Define TURBO_MODE if more bandwidth if required
        // to enable radio to operate to TX/RX maximum 
        // 625Kbps
        #ifdef TURBO_MODE
        
            PHYSetShortRAMAddr(WRITE_BBREG0, 0x01);
            PHYSetShortRAMAddr(WRITE_BBREG3, 0x38);
            PHYSetShortRAMAddr(WRITE_BBREG4, 0x5C);
            
            PHYSetShortRAMAddr(WRITE_RFCTL,0x04);
            PHYSetShortRAMAddr(WRITE_RFCTL,0x00);
    
        #endif           
        
    }
        
    
    /************************************************************************************
     * Function:
     *      BOOL MiMAC_ReceivedPacket(void)
     *
     * Summary:
     *      This function check if a new packet has been received by the RF transceiver
     *
     * Description:        
     *      This is the primary MiMAC interface for the protocol layer to 
     *      check if a packet has been received by the RF transceiver. When a packet has
     *      been received, all information will be stored in the global variable 
     *      MACRxPacket in the format of MAC_RECEIVED_PACKET;
     *
     * PreCondition:    
     *      MiMAC initialization has been done. 
     *
     * Parameters: 
     *      None
     *
     * Returns: 
     *      A boolean to indicate if a packet has been received by the RF transceiver.
     *
     * Example:
     *      <code>
     *      if( TRUE == MiMAC_ReceivedPacket() )
     *      {
     *          // handle the raw data from RF transceiver
     * 
     *          // discard the current packet
     *          MiMAC_DiscardPacket();
     *      }
     *      </code>
     *
     * Remarks:    
     *      None
     *
     *****************************************************************************************/ 
    BOOL MiMAC_ReceivedPacket(void)
    {   
        //set the interrupt flag just in case the interrupt was missed
        if(RF_INT_PIN == 0u)
        {
            RFIF = 1;
        }
        
        //If the stack TX has been busy for a long time then
        //time out the TX because we may have missed the interrupt 
        //and don't want to lock up the stack forever
        if(MRF24J40Status.bits.TX_BUSY)
        {
            if(failureCounter >= (unsigned) FAILURE_COUNTER)
            {
                failureCounter = 0;
                MRF24J40Status.bits.TX_BUSY = 0;
            }
            else
            {
                failureCounter++;
            }
        }
  
        if(MRF24J40Status.bits.RX_BUFFERED == 1u)
        {
            BYTE addrMode;
            #ifndef TARGET_SMALL
                BOOL bIntraPAN = TRUE;
            
                if( (RxBuffer[1] & 0x40) == 0u )
                {
                    bIntraPAN = FALSE;   
                }
            #endif
            MACRxPacket.flags.Val = 0;
            MACRxPacket.altSourceAddress = FALSE;
            
            //Determine the start of the MAC payload
            addrMode = RxBuffer[2] & 0xCC;
            switch(addrMode)
            {
                case 0xC8: //short dest, long source
                    // for P2P only broadcast allows short destination address
                    if( RxBuffer[6] == 0xFF && RxBuffer[7] == 0xFF )
                    {
                        MACRxPacket.flags.bits.broadcast = 1;
                    }
                    MACRxPacket.flags.bits.sourcePrsnt = 1;
                    
