span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
                    #ifndef TARGET_SMALL
                        if( bIntraPAN ) // check if it is intraPAN
                    #endif
                    {
                        #ifndef TARGET_SMALL
                            MACRxPacket.SourcePANID.v[0] = RxBuffer[4];
                            MACRxPacket.SourcePANID.v[1] = RxBuffer[5];
                        #endif
                        MACRxPacket.SourceAddress = &(RxBuffer[8]);
                        
                        MACRxPacket.PayloadLen = RxBuffer[0] - 19;
                        MACRxPacket.Payload = &(RxBuffer[16]);   
                    }
                    #ifndef TARGET_SMALL
                        else
                        {
                            MACRxPacket.SourcePANID.v[0] = RxBuffer[8];
                            MACRxPacket.SourcePANID.v[1] = RxBuffer[9];
                            MACRxPacket.SourceAddress = &(RxBuffer[10]);
                            MACRxPacket.PayloadLen = RxBuffer[0] - 21;
                            MACRxPacket.Payload = &(RxBuffer[18]);
                        }
                    #endif

                    break;
                
                case 0xCC: // long dest, long source
                    MACRxPacket.flags.bits.sourcePrsnt = 1;
                    #ifndef TARGET_SMALL
                        if( bIntraPAN ) // check if it is intraPAN
                    #endif
                    {
                        //rxFrame.flags.bits.intraPAN = 1;
                        #ifndef TARGET_SMALL
                            MACRxPacket.SourcePANID.v[0] = RxBuffer[4];
                            MACRxPacket.SourcePANID.v[1] = RxBuffer[5];
                        #endif
                        MACRxPacket.SourceAddress = &(RxBuffer[14]);
                        MACRxPacket.PayloadLen = RxBuffer[0] - 25;
                        MACRxPacket.Payload = &(RxBuffer[22]);    
                    } 
                    #ifndef TARGET_SMALL
                        else
                        {
                            MACRxPacket.SourcePANID.v[0] = RxBuffer[14];
                            MACRxPacket.SourcePANID.v[1] = RxBuffer[15];
                            MACRxPacket.SourceAddress = &(RxBuffer[16]);
                            MACRxPacket.PayloadLen = RxBuffer[0] - 27;
                            MACRxPacket.Payload = &(RxBuffer[24]);
                        }
                    #endif
                    break;
                
                case 0x80:      // short source only. used in beacon
                    {
                        MACRxPacket.flags.bits.broadcast = 1;
                        MACRxPacket.flags.bits.sourcePrsnt = 1;
                        MACRxPacket.altSourceAddress = TRUE;
                        MACRxPacket.SourcePANID.v[0] = RxBuffer[4];
                        MACRxPacket.SourcePANID.v[1] = RxBuffer[5];
                        MACRxPacket.SourceAddress = &(RxBuffer[6]);
                        MACRxPacket.PayloadLen = RxBuffer[0] - 11;
                        MACRxPacket.Payload = &(RxBuffer[8]);
                    }
                    break;
                        
                case 0x88: // short dest, short source
                    {
                        if( RxBuffer[6] == 0xFF && RxBuffer[7] == 0xFF )
                        {
                            MACRxPacket.flags.bits.broadcast = 1;
                        }
                        MACRxPacket.flags.bits.sourcePrsnt = 1;
                        MACRxPacket.altSourceAddress = TRUE;
                        #ifndef TARGET_SMALL
                            if( bIntraPAN == FALSE )
                            {
                                MACRxPacket.SourcePANID.v[0] = RxBuffer[8];
                                MACRxPacket.SourcePANID.v[1] = RxBuffer[9];
                                MACRxPacket.SourceAddress = &(RxBuffer[10]);
                                MACRxPacket.PayloadLen = RxBuffer[0] - 15;
                                MACRxPacket.Payload = &(RxBuffer[12]);
                            }
                            else
                        #endif
                        {
                            MACRxPacket.SourcePANID.v[0] = RxBuffer[4];
                            MACRxPacket.SourcePANID.v[1] = RxBuffer[5];
                            MACRxPacket.SourceAddress = &(RxBuffer[8]);
                            MACRxPacket.PayloadLen = RxBuffer[0] - 13;
                            MACRxPacket.Payload = &(RxBuffer[10]);
                        }     
                    }
                    break;
                
                
                case 0x08: //dest-short, source-none
                case 0x8C: //long dest, short source
                    // all other addressing mode will not be supported in P2P
                default:
                    // not valid addressing mode or no addressing info
                    MiMAC_DiscardPacket();
                    return FALSE;             
            }  
            
            #ifdef ENABLE_SECURITY
                if( RxBuffer[1] & 0x08 )
                {
                    // if security is used, remove the security header and MIC from
                    // the payload size
                    switch(mySecurityLevel)
                    {
                        case 0x02:
                        case 0x05:
                            MACRxPacket.PayloadLen -= 21;
                            break;
                        case 0x03:
                        case 0x06:
                            MACRxPacket.PayloadLen -= 13;
                            break;
                        case 0x04:
                        case 0x07:
                            MACRxPacket.PayloadLen -= 9;
                            break;
                        case 0x01:
                            MACRxPacket.PayloadLen -= 5;
                            break;
                        default:
                            break;    
                    }
                    // remove the security header from the payload 
                    MACRxPacket.Payload = &(MACRxPacket.Payload[5]);
                    MACRxPacket.flags.bits.secEn = 1;
                }
            #else
                if( RxBuffer[1] & 0x08 )
                {
                    MiMAC_DiscardPacket();
                    return FALSE;
                }
            #endif
    
            // check the frame type. Only the data and command frame type
            // are supported. Acknowledgement frame type is handled in 
            // MRF24J40 transceiver hardware.
            switch( RxBuffer[1] & 0x07 ) // check frame type
            {
                case 0x01:  // data frame
                    MACRxPacket.flags.bits.packetType = PACKET_TYPE_DATA;
                    break;
                case 0x03:  // command frame
                    MACRxPacket.flags.bits.packetType = PACKET_TYPE_COMMAND;
                    break;
                case 0x00:
                    // use reserved packet type to represent beacon packet
                    MACRxPacket.flags.bits.packetType = PACKET_TYPE_RESERVE;
                    break;
                default:    // not support frame type
                    MiMAC_DiscardPacket();
                    return FALSE;
            }
            #ifndef TARGET_SMALL
                MACRxPacket.LQIValue = RxBuffer[RxBuffer[0]-1];
                MACRxPacket.RSSIValue = RxBuffer[RxBuffer[0]];
            #endif
      
