span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
            return TRUE;
        }
        return FALSE;
    }
    
    
    /************************************************************************************
     * Function:
     *      void MiMAC_DiscardPacket(void)
     *
     * Summary:
     *      This function discard the current packet received from the RF transceiver
     *
     * Description:        
     *      This is the primary MiMAC interface for the protocol layer to 
     *      discard the current packet received from the RF transceiver.
     *
     * PreCondition:    
     *      MiMAC initialization has been done. 
     *
     * Parameters: 
     *      None
     *
     * Returns: 
     *      None
     *
     * Example:
     *      <code>
     *      if( TRUE == MiMAC_ReceivedPacket() )
     *      {
     *          // handle the raw data from RF transceiver
     * 
     *          // discard the current packet
     *          MiMAC_DiscardPacket();
     *      }
     *      </code>
     *
     * Remarks:    
     *      None
     *
     *****************************************************************************************/ 
    void MiMAC_DiscardPacket(void)
    {
        //re-enable the ACKS
        MRF24J40Status.bits.RX_BUFFERED = 0;
    }
    
    
    /************************************************************************************
     * Function:
     *      BOOL MiMAC_SendPacket(  MAC_TRANS_PARAM transParam, 
     *                              BYTE *MACPayload, BYTE MACPayloadLen)
     *
     * Summary:
     *      This function transmit a packet
     *
     * Description:        
     *      This is the primary MiMAC interface for the protocol layer to 
     *      send a packet. Input parameter transParam configure the way
     *      to transmit the packet.
     *
     * PreCondition:    
     *      MiMAC initialization has been done. 
     *
     * Parameters: 
     *      MAC_TRANS_PARAM transParam -    The struture to configure the transmission way
     *      BYTE * MACPaylaod -             Pointer to the buffer of MAC payload
     *      BYTE MACPayloadLen -            The size of the MAC payload
     *
     * Returns: 
     *      A boolean to indicate if a packet has been received by the RF transceiver.
     *
     * Example:
     *      <code>
     *      MiMAC_SendPacket(transParam, MACPayload, MACPayloadLen);
     *      </code>
     *
     * Remarks:    
     *      None
     *
     *****************************************************************************************/    
    BOOL MiMAC_SendPacket( INPUT MAC_TRANS_PARAM transParam, 
                        INPUT BYTE *MACPayload, 
                        INPUT BYTE MACPayloadLen)
    {
        BYTE headerLength;
        BYTE loc = 0;
        BYTE i = 0;
        #ifndef TARGET_SMALL
            BOOL IntraPAN;
        #endif
        #ifdef VERIFY_TRANSMIT
            WORD w;
        #endif
    
        if( transParam.flags.bits.broadcast )
        {
            transParam.altDestAddr = TRUE;
        }
        
        if( transParam.flags.bits.secEn )
        {
            transParam.altSrcAddr = FALSE;
        }
        
    
        // wait for the previous transmission finish
        #if !defined(VERIFY_TRANSMIT)
            t1 = TickGet();
        #endif
        while( MRF24J40Status.bits.TX_BUSY ) 
        {
            if(RF_INT_PIN == 0u)
            {
                RFIF = 1;
            }
            #if !defined(VERIFY_TRANSMIT)
                t2 = TickGet();
                t2.Val = TickGetDiff(t2, t1);
                if( t2.Val > TWENTY_MILI_SECOND ) // 20 ms
                {
                    InitMRF24J40();  
                    //MiMAC_SetChannel(MACCurrentChannel, 0);
                    MiMAC_SetAltAddress(myNetworkAddress.v, MAC_PANID.v);  
                }
            #endif
        }
        
        // set the frame control in variable i    
        if( transParam.flags.bits.packetType == (unsigned) PACKET_TYPE_COMMAND )
        {
            i = 0x03;
        }
        else if( transParam.flags.bits.packetType == (unsigned) PACKET_TYPE_DATA)
        {
            i = 0x01;
        }
        

        // decide the header length for different addressing mode
        #ifndef TARGET_SMALL
            if( (transParam.DestPANID.Val == MAC_PANID.Val) && (MAC_PANID.Val != 0xFFFF) ) // this is intraPAN
        #endif
        {
            headerLength = 5;
            i |= 0x40;
            #ifndef TARGET_SMALL
                IntraPAN = TRUE;
            #endif
        }
        
        #ifndef TARGET_SMALL
        else
        {
            headerLength = 7;
            IntraPAN = FALSE;
        }
        #endif
        
        if( transParam.altDestAddr )
        {
            headerLength += 2;
        }
        else
        {
            headerLength += 8;
        }
        
        if( transParam.altSrcAddr )
        {
            headerLength += 2;
        }
        else
        {
            headerLength += 8;
        }
        
        #ifdef ENABLE_SECURITY
            if( transParam.flags.bits.secEn )
            {
                i |= 0x08;   
            }
        #endif
        
        if( transParam.flags.bits.ackReq && transParam.flags.bits.broadcast == FALSE ) 
        {
            i |= 0x20;   
        }
        
        // use PACKET_TYPE_RESERVE to represent beacon. Fixed format for beacon packet
        if( transParam.flags.bits.packetType == (unsigned) PACKET_TYPE_RESERVE)
        {
            i = 0x00;
            headerLength = 7;
            #if !defined(TARGET_SMALL)
                IntraPAN = FALSE;
            #endif
            transParam.altSrcAddr = TRUE;
            transParam.flags.bits.ackReq = FALSE;
        }
    
        // set header length
        PHYSetLongRAMAddr(loc++, headerLength);
        // set packet length
        #ifdef ENABLE_SECURITY
            if( transParam.flags.bits.secEn )
            {
                PHYSetLongRAMAddr(loc++, headerLength + MACPayloadLen + 5);
            }
            else
        #endif
        {
            PHYSetLongRAMAddr(loc++, headerLength + MACPayloadLen);
        }
        
