span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
        // set frame control LSB
        PHYSetLongRAMAddr(loc++, i);
        
        // set frame control MSB
        if( transParam.flags.bits.packetType == (unsigned) PACKET_TYPE_RESERVE )
        {
            PHYSetLongRAMAddr(loc++, 0x80);
            // sequence number
            PHYSetLongRAMAddr(loc++, IEEESeqNum++);
        }
        else 
        {
            if( transParam.altDestAddr && transParam.altSrcAddr )
            {
                PHYSetLongRAMAddr(loc++, 0x88);
            }
            else if( transParam.altDestAddr && transParam.altSrcAddr == 0 )
            {
                PHYSetLongRAMAddr(loc++, 0xC8);
            }
            else if( transParam.altDestAddr == 0 && transParam.altSrcAddr == 1 )
            {
                PHYSetLongRAMAddr(loc++, 0x8C);
            }
            else
            {
                PHYSetLongRAMAddr(loc++, 0xCC);
            }
            
            // sequence number
            PHYSetLongRAMAddr(loc++, IEEESeqNum++);
            
            // destination PANID     
            PHYSetLongRAMAddr(loc++, transParam.DestPANID.v[0]);
            PHYSetLongRAMAddr(loc++, transParam.DestPANID.v[1]);
            
            // destination address
            if( transParam.flags.bits.broadcast )
            {
                PHYSetLongRAMAddr(loc++, 0xFF);
                PHYSetLongRAMAddr(loc++, 0xFF);
            }
            else
            {
                if( transParam.altDestAddr )
                {
                    PHYSetLongRAMAddr(loc++, transParam.DestAddress[0]);
                    PHYSetLongRAMAddr(loc++, transParam.DestAddress[1]);
                }
                else
                {
                    for(i = 0; i < 8u; i++)
                    {
                        PHYSetLongRAMAddr(loc++, transParam.DestAddress[i]);
                    }
                }
            }
        }
        
        #ifndef TARGET_SMALL
            // source PANID if necessary
            if( IntraPAN == FALSE )
            {
                PHYSetLongRAMAddr(loc++, MAC_PANID.v[0]);
                PHYSetLongRAMAddr(loc++, MAC_PANID.v[1]);
            }
        #endif
        
        // source address
        if( transParam.altSrcAddr )
        {
            PHYSetLongRAMAddr(loc++, myNetworkAddress.v[0]);
            PHYSetLongRAMAddr(loc++, myNetworkAddress.v[1]);
        }
        else
        {
            for(i = 0; i < 8u; i++)
            {
                PHYSetLongRAMAddr(loc++, MACInitParams.PAddress[i]);
            }
        }
        
        #ifdef ENABLE_SECURITY
            if( transParam.flags.bits.secEn )
            {
                // fill the additional security aux header
                for(i = 0; i < 4; i++)
                {
                    PHYSetLongRAMAddr(loc++, OutgoingFrameCounter.v[i]);
                }
                OutgoingFrameCounter.Val++;
                PHYSetLongRAMAddr(loc++, myKeySequenceNumber);
                
                // fill the security key
                for(i = 0; i < 16; i++)
                {
                    PHYSetLongRAMAddr(0x280 + i, mySecurityKey[i]);
                }
                
                // set the cipher mode
                PHYSetShortRAMAddr(WRITE_SECCR0, mySecurityLevel);
            }
        #endif
        
        
        // write the payload
        for(i = 0; i < MACPayloadLen; i++)
        {
            PHYSetLongRAMAddr(loc++, MACPayload[i]);
        }
        
        MRF24J40Status.bits.TX_BUSY = 1;
    
        // set the trigger value
        if( transParam.flags.bits.ackReq && transParam.flags.bits.broadcast == FALSE )
        {
            i = 0x05;
            #ifndef TARGET_SMALL
                MRF24J40Status.bits.TX_PENDING_ACK = 1;
            #endif
        }
        else
        {
            i = 0x01;
            #ifndef TARGET_SMALL
                MRF24J40Status.bits.TX_PENDING_ACK = 0;
            #endif
        }
        #ifdef ENABLE_SECURITY
            if( transParam.flags.bits.secEn )
            {
                i |= 0x02;
            }
        #endif
        
        // now trigger the transmission
        PHYSetShortRAMAddr(WRITE_TXNMTRIG, i); 
        
        #ifdef VERIFY_TRANSMIT
            w = 0;
            while(1)
            {   
                if( RF_INT_PIN == 0u )
                {
                    RFIF = 1;
                }
                if( MRF24J40Status.bits.TX_BUSY == 0u )
                {
                    if( MRF24J40Status.bits.TX_FAIL )
                    {
                        MRF24J40Status.bits.TX_FAIL = 0;
                        return FALSE;
                    }
                    break;   
                }
                if( ++w > 0xFFFE )
                {
                    InitMRF24J40();
                    //MiMAC_SetChannel(MACCurrentChannel, 0);
                    MiMAC_SetAltAddress(myNetworkAddress.v, MAC_PANID.v);
                    return FALSE;
                }
            }
        #endif
       
        return TRUE;    
        
    }

    
    #if defined(ENABLE_ED_SCAN) 
        /************************************************************************************
         * Function:
         *      BYTE MiMAC_ChannelAssessment(BYTE AssessmentMode)
         *
         * Summary:
         *      This function perform the noise detection on current operating channel
         *
         * Description:        
         *      This is the primary MiMAC interface for the protocol layer to 
         *      perform the noise detection scan. Not all assessment modes are supported
         *      for all RF transceivers.
         *
         * PreCondition:    
         *      MiMAC initialization has been done.  
         *
         * Parameters: 
         *      BYTE AssessmentMode -   The mode to perform noise assessment. The possible 
         *                              assessment modes are
         *                              * CHANNEL_ASSESSMENT_CARRIER_SENSE Carrier sense detection mode
         *                              * CHANNEL_ASSESSMENT_ENERGY_DETECT Energy detection mode
         *
         * Returns: 
         *      A byte to indicate the noise level at current channel.
         *
         * Example:
         *      <code>
         *      NoiseLevel = MiMAC_ChannelAssessment(CHANNEL_ASSESSMENT_CARRIER_SENSE);
         *      </code>
         *
         * Remarks:    
         *      None
         *
         *****************************************************************************************/     
        BYTE MiMAC_ChannelAssessment(INPUT BYTE AssessmentMode)
        {
            BYTE RSSIcheck;
            
            #if defined(ENABLE_PA_LNA)
                PHYSetLongRAMAddr(TESTMODE, 0x08);              // Disable automatic switch on PA/LNA
                PHYSetShortRAMAddr(WRITE_GPIODIR, 0x0F);        // Set GPIO direction
                PHYSetShortRAMAddr(WRITE_GPIO, 0x0C);           // Enable LNA
            #endif
            
            // calculate RSSI for firmware request
            PHYSetShortRAMAddr(WRITE_BBREG6, 0x80);                                                 
            
            // Firmware Request the RSSI
            RSSIcheck = PHYGetShortRAMAddr (READ_BBREG6);
            while ((RSSIcheck & 0x01) != 0x01)
            {
                RSSIcheck = PHYGetShortRAMAddr (READ_BBREG6);
            }
            
            // read the RSSI
            RSSIcheck = PHYGetLongRAMAddr(0x210);
            
            // enable RSSI attached to received packet again after
            // the energy scan is finished
            PHYSetShortRAMAddr(WRITE_BBREG6, 0x40);
            
            #if defined(ENABLE_PA_LNA)
                PHYSetShortRAMAddr(WRITE_GPIO, 0);
                PHYSetShortRAMAddr(WRITE_GPIODIR, 0x00);
                PHYSetLongRAMAddr(TESTMODE, 0x0F);
            #endif
            
