span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
            return RSSIcheck;
        }
    #endif
    

    #if defined(ENABLE_SLEEP)
        /************************************************************************************
         * Function:
         *      BOOL MiMAC_PowerState(BYTE PowerState)
         *
         * Summary:
         *      This function puts the RF transceiver into sleep or wake it up
         *
         * Description:        
         *      This is the primary MiMAC interface for the protocol layer to 
         *      set different power state for the RF transceiver. There are minimal 
         *      power states defined as deep sleep and operating mode. Additional
         *      power states can be defined for individual RF transceiver depends
         *      on hardware design.
         *
         * PreCondition:    
         *      MiMAC initialization has been done. 
         *
         * Parameters: 
         *      BYTE PowerState -   The power state of the RF transceiver to be set to. 
         *                          The minimum definitions for all RF transceivers are
         *                          * POWER_STATE_DEEP_SLEEP RF transceiver deep sleep mode.
         *                          * POWER_STATE_OPERATE RF transceiver operating mode.
         * Returns: 
         *      A boolean to indicate if chaning power state of RF transceiver is successful.
         *
         * Example:
         *      <code>
         *      // Put RF transceiver into sleep
         *      MiMAC_PowerState(POWER_STATE_DEEP_SLEEP);
         *      // Put MCU to sleep
         *      Sleep();
         *      // Wake up the MCU by WDT, external interrupt or any other means
         *
         *      // Wake up the RF transceiver
         *      MiMAC_PowerState(POWER_STATE_OPERATE); 
         *      </code>
         *
         * Remarks:    
         *      None
         *
         *****************************************************************************************/    
        BOOL MiMAC_PowerState(INPUT BYTE PowerState)
        {
            switch(PowerState)
            {
                case POWER_STATE_DEEP_SLEEP:
                    {
                        //;clear the WAKE pin in order to allow the device to go to sleep
                        PHY_WAKE = 0;
                        
                        #if defined(ENABLE_PA_LNA)
                            PHYSetLongRAMAddr(TESTMODE, 0x08);              // Disable automatic switch on PA/LNA
                            PHYSetShortRAMAddr(WRITE_GPIODIR, 0x0F);        // Set GPIO direction
                            PHYSetShortRAMAddr(WRITE_GPIO, 0x00);           // Disable PA and LNA
                        #endif
                        
                        // make a power management reset to ensure device goes to sleep
                        PHYSetShortRAMAddr(WRITE_SOFTRST, 0x04);
                        
                        //;write the registers required to place the device in sleep
                        PHYSetShortRAMAddr(WRITE_TXBCNINTL,0x80);
                        PHYSetShortRAMAddr(WRITE_RXFLUSH,0x60);
                        PHYSetShortRAMAddr(WRITE_SLPACK,0x80);
                    }
                    break;
                    
                case POWER_STATE_OPERATE:
                    {
                        BYTE results;
                        
                        //wake up the device
                        PHY_WAKE = 1;
                    
                        t1 = TickGet();
                        
                        while(1)
                        {
                            t2 = TickGet();
                            t2.Val = TickGetDiff(t2, t1);
                            
                            // if timeout, assume the device has waken up
                            if( t2.Val > HUNDRED_MILI_SECOND)
                            {
                                InitMRF24J40();
                                //MiMAC_SetChannel(MACCurrentChannel);
                                MiMAC_SetAltAddress(myNetworkAddress.v, MAC_PANID.v);
                                break;
                            }
                        
                            results = PHYGetShortRAMAddr(READ_ISRSTS);
                            if((results & 0x40) != 0x00)
                            {
                                break;
                            }
                        }
                
                        while(1)
                        {
                            t2 = TickGet();
                            t2.Val = TickGetDiff(t2, t1);
                            
                            // if timeout, assume the device has waken up
                            if( t2.Val > HUNDRED_MILI_SECOND )
                            {
                                InitMRF24J40();
                                //MiMAC_SetChannel(MACCurrentChannel);
                                MiMAC_SetAltAddress(myNetworkAddress.v, MAC_PANID.v);
                                break;
                            }
                            
                            results = PHYGetLongRAMAddr(RFSTATE);
                            if( (results & 0xE0) == 0xA0 )
                            {
                                break;
                            }
                            
                        }
                        
                        PHYSetShortRAMAddr(WRITE_RFCTL, 0x04);  
                        PHYSetShortRAMAddr(WRITE_RFCTL, 0x00); 
                        
                        #if defined(ENABLE_PA_LNA)
                            PHYSetShortRAMAddr(WRITE_GPIO, 0);
                            PHYSetShortRAMAddr(WRITE_GPIODIR, 0x00);
                            PHYSetLongRAMAddr(TESTMODE, 0x0F);
                        #endif             
                    }
                    break;
                    
                default:
                    return FALSE;
            }
            return TRUE;
        }
    #endif

    /************************************************************************************
     * Function:
     *      BOOL MiMAC_SetChannel(BYTE channel, BYTE offsetFreq)
     *
     * Summary:
     *      This function set the operating channel for the RF transceiver
     *
     * Description:        
     *      This is the primary MiMAC interface for the protocol layer to 
     *      set the operating frequency of the RF transceiver. Valid channel
     *      number are from 0 to 31. For different frequency band, data rate
     *      and other RF settings, some channels from 0 to 31 might be
     *      unavailable. Paramater offsetFreq is used to fine tune the center
     *      frequency across the frequency band. For transceivers that follow
     *      strict definition of channels, this parameter may be discarded.
     *      The center frequency is calculated as 
     *      (LowestFrequency + Channel * ChannelGap + offsetFreq)
     *
     * PreCondition:    
     *      Hardware initialization on MCU has been done. 
     *
     * Parameters: 
     *      BYTE channel -  Channel number. Range from 0 to 31. Not all channels
     *                      are available under all conditions.
     *      BYTE offsetFreq -   Offset frequency used to fine tune the center 
     *                          frequency. May not apply to all RF transceivers
     *
     * Returns: 
     *      A boolean to indicates if channel setting is successful.
     *
     * Example:
     *      <code>
     *      // Set center frequency to be exactly channel 12
     *      MiMAC_SetChannel(12, 0);
     *      </code>
     *
     * Remarks:    
     *      None
     *
     *****************************************************************************************/      
    BOOL MiMAC_SetChannel(INPUT BYTE channel, INPUT BYTE offsetFreq)
    {
        if( channel < 11u || channel > 26u)
        {
            return FALSE;
        }
        
