span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
        #if defined(ENABLE_PA_LNA) && defined(MRF24J40MB)
            if( channel == 26u )
            {
                return FALSE;
            }
        #endif
        
        MACCurrentChannel = channel;
        PHYSetLongRAMAddr(RFCTRL0,((channel-11)<<4)|0x03);
        PHYSetShortRAMAddr(WRITE_RFCTL,0x04);
        PHYSetShortRAMAddr(WRITE_RFCTL,0x00);   
        return TRUE;  
    }
    
    
    /************************************************************************************
     * Function:
     *      BOOL MiMAC_SetPower(BYTE outputPower)
     *
     * Summary:
     *      This function set the output power for the RF transceiver
     *
     * Description:        
     *      This is the primary MiMAC interface for the protocol layer to 
     *      set the output power for the RF transceiver. Whether the RF
     *      transceiver can adjust output power depends on the hardware
     *      implementation.
     *
     * PreCondition:    
     *      MiMAC initialization has been done. 
     *
     * Parameters: 
     *      BYTE outputPower -  RF transceiver output power. 
     *
     * Returns: 
     *      A boolean to indicates if setting output power is successful.
     *
     * Example:
     *      <code>
     *      // Set output power to be 0dBm
     *      MiMAC_SetPower(TX_POWER_0_DB);
     *      </code>
     *
     * Remarks:    
     *      None
     *
     *****************************************************************************************/ 
    BOOL MiMAC_SetPower(INPUT BYTE outputPower)
    {
        BYTE reg;
        BYTE tmp = outputPower % 10;
    
        reg = (outputPower / 10) << 6;
        if( tmp > 5u )
        {
            reg += 0x38;
        }
        else if( tmp > 4u )
        {
            reg += 0x30;
        }
        else if( tmp > 3u )
        {
            reg += 0x28;
        }
        else if( tmp > 2u )
        {
            reg += 0x20;
        }
        else if( tmp > 1u )
        {
            reg += 0x18;
        }
        else if( tmp > 0u )
        {
            reg += 0x10;
        }
    
        PHYSetLongRAMAddr(RFCTRL3,reg);
        return TRUE;
    }
    
    
    /************************************************************************************
     * Function:
     *      BOOL MiMAC_SetAltAddress(BYTE *Address, BYTE *PANID)
     *
     * Summary:
     *      This function set the alternative network address and PAN identifier if
     *      applicable
     *
     * Description:        
     *      This is the primary MiMAC interface for the protocol layer to 
     *      set alternative network address and/or PAN identifier. This function
     *      call applies to only IEEE 802.15.4 compliant RF transceivers. In case
     *      alternative network address is not supported, this function will return
     *      FALSE.
     *
     * PreCondition:    
     *      MiMAC initialization has been done. 
     *
     * Parameters: 
     *      BYTE * Address -    The alternative network address of the host device.
     *      BYTE * PANID -      The PAN identifier of the host device
     *
     * Returns: 
     *      A boolean to indicates if setting alternative network address is successful.
     *
     * Example:
     *      <code>
     *      WORD NetworkAddress = 0x0000;
     *      WORD PANID = 0x1234;
     *      MiMAC_SetAltAddress(&NetworkAddress, &PANID);
     *      </code>
     *
     * Remarks:    
     *      None
     *
     *****************************************************************************************/ 
    BOOL MiMAC_SetAltAddress(INPUT BYTE *Address, INPUT BYTE *PANID)
    {
        myNetworkAddress.v[0] = Address[0];
        myNetworkAddress.v[1] = Address[1];
        MAC_PANID.v[0] = PANID[0];
        MAC_PANID.v[1] = PANID[1];
        
        PHYSetShortRAMAddr(WRITE_SADRL,myNetworkAddress.v[0]);
        PHYSetShortRAMAddr(WRITE_SADRH,myNetworkAddress.v[1]);
        PHYSetShortRAMAddr(WRITE_PANIDL,MAC_PANID.v[0]);
        PHYSetShortRAMAddr(WRITE_PANIDH,MAC_PANID.v[1]);
        return TRUE;    
    }
    
    
    /************************************************************************************
     * Function:
     *      BOOL MiMAC_Init(MACINIT_PARAM initValue)
     *
     * Summary:
     *      This function initialize MiMAC layer
     *
     * Description:        
     *      This is the primary MiMAC interface for the protocol layer to 
     *      initialize the MiMAC layer. The initialization parameter is 
     *      assigned in the format of structure MACINIT_PARAM.
     *
     * PreCondition:    
     *      MCU initialization has been done. 
     *
     * Parameters: 
     *      MACINIT_PARAM initValue -   Initialization value for MiMAC layer
     *
     * Returns: 
     *      A boolean to indicates if initialization is successful.
     *
     * Example:
     *      <code>
     *      MiMAC_Init(initParameter);
     *      </code>
     *
     * Remarks:    
     *      None
     *
     *****************************************************************************************/ 
    BOOL MiMAC_Init(INPUT MACINIT_PARAM initValue)
    {   
        MACInitParams = initValue;

        IEEESeqNum = TMRL;
        
        MACCurrentChannel = 11;
           
        InitMRF24J40();
        
        MRF24J40Status.Val = 0;
            
        #ifdef ENABLE_SECURITY
        	OutgoingFrameCounter.Val = 1;
        #endif 
        
        return TRUE;
    }
    
    /*********************************************************************
     * void HighISR(void)
     *
     * Overview:        This is the interrupt handler for the MRF24J40 and
     *                  P2P stack. 
     *
     * PreCondition:    None
     *
     * Input:           None
     *
     * Output:          None
     *
     * Side Effects:    Various flags and registers set.
     *
     ********************************************************************/
    #if defined(__18CXX)
        #pragma interruptlow HighISR
        void HighISR(void)
    #elif defined(__dsPIC30F__) || defined(__dsPIC33F__) || defined(__PIC24F__) || defined(__PIC24H__)
        void _ISRFAST __attribute__((interrupt, auto_psv)) _INT1Interrupt(void)
    #elif defined(__PIC32MX__)
        void __ISR(_EXTERNAL_1_VECTOR, ipl4) _INT1Interrupt(void)
    #else
        void _ISRFAST _INT1Interrupt(void)
    #endif
    {
        // a flag indicating if a higher priority task may have been woken
        // because of actions taken during this ISR
	    portBASE_TYPE taskWoken = pdFALSE;
	    
        if(RFIE && RFIF)
        {  
            BYTE i;
            BYTE j;
              
            //clear the interrupt flag as soon as possible such that another interrupt can
            //occur quickly.
            RFIF = 0;

            //create a new scope for the MRF24J40 interrupts so that we can clear the interrupt
            //flag quickly and then handle the interrupt that we have already received
            {
                MRF24J40_IFREG flags;        
    
