span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
                //read the interrupt status register to see what caused the interrupt        
                flags.Val=PHYGetShortRAMAddr(READ_ISRSTS);

                if(flags.bits.RF_TXIF)
                {
                    //if the TX interrupt was triggered
                    //clear the busy flag indicating the transmission was complete
                    MRF24J40Status.bits.TX_BUSY = 0;
                    
                    failureCounter = 0;
                    
                    #ifndef TARGET_SMALL
                        //if we were waiting for an ACK
                        if(MRF24J40Status.bits.TX_PENDING_ACK)
                        {
                            BYTE_VAL results;
                            
                            //read out the results of the transmission
                            results.Val = PHYGetShortRAMAddr(READ_TXSR);
                            
                            if(results.bits.b0 == 1u)
                            {
                                //the transmission wasn't successful and the number
                                //of retries is located in bits 7-6 of TXSR
                                MRF24J40Status.bits.TX_FAIL = 1;
                            }

                            //transmission finished
                            //clear that I am pending an ACK, already got it
                            MRF24J40Status.bits.TX_PENDING_ACK = 0;

                        }
                    #endif
                }
                
                if(flags.bits.RF_RXIF)
                {  
                    //if the RX interrupt was triggered
                    if(MRF24J40Status.bits.RX_BUFFERED == 0u)
                    {
                        #ifdef ENABLE_SECURITY
                            if( MRF24J40Status.bits.RX_SECURITY )
                            {
                                BYTE DecryptionStatus = PHYGetShortRAMAddr(READ_SECISR);
                                BYTE FrameControl;
                                
                                MRF24J40Status.bits.RX_SECURITY = 0;
                                if( (DecryptionStatus & 0x02) != 0 )
                                {
                                    PHYSetShortRAMAddr(WRITE_RXFLUSH,0x01);
                                    goto START_OF_SEC_INT;
                                }
                                
                                i = 6;
                                FrameControl = PHYGetLongRAMAddr(0x301);
                                if( (FrameControl & 0x40) == 0 ) // intra PAN?
                                {
                                    i += 2;
                                }
                                
                                FrameControl = PHYGetLongRAMAddr(0x302);
                                if( (FrameControl & 0x0C) == 0x0C )
                                {
                                    i += 8;
                                }
                                else
                                {
                                    i += 2;
                                }
            
                                // get the source address
                                for(j = 0; j < 8; j++)
                                {
                                    tmpSourceLongAddress[j] = PHYGetLongRAMAddr(0x300 + i + j);
                                }
                              
                                for(j = 0; j < 4; j++)
                                {
                                    tmpFrameCounter.v[j] = PHYGetLongRAMAddr(0x308 + i + j);
                                }
                                

                                for(i = 0; i < CONNECTION_SIZE; i++)
                                {
                                    if( (ConnectionTable[i].status.bits.isValid) && 
                                        isSameAddress(ConnectionTable[i].Address, tmpSourceLongAddress) )
                                    {
                                        break;
                                    }
                                }
                                if( i < CONNECTION_SIZE )
                                {
                                    if( IncomingFrameCounter[i].Val > tmpFrameCounter.Val )
                                    {
                                        PHYSetShortRAMAddr(WRITE_RXFLUSH,0x01);  
                                        goto START_OF_SEC_INT;
                                    }
                                    else
                                    {
                                        IncomingFrameCounter[i].Val = tmpFrameCounter.Val;
                                    }
                                }

                            }
                            else
                        #endif
                        #if defined(ENABLE_SECURITY) && !defined(TARGET_SMALL)
                            if( MRF24J40Status.bits.RX_IGNORE_SECURITY )
                            {
                                MRF24J40Status.bits.RX_IGNORE_SECURITY = 0;
                                PHYSetShortRAMAddr(WRITE_RXFLUSH,0x01);
                                goto START_OF_SEC_INT; 
                            }
                        #endif
                        //If the part is enabled for receiving packets right now
                        //(not pending an ACK)
                        //indicate that we have a packet in the buffer pending to 
                        //be read into the buffer from the FIFO
                        PHYSetShortRAMAddr(WRITE_BBREG1, 0x04);

                        //get the size of the packet
                        //2 more bytes for RSSI and LQI reading 
                        RxBuffer[0] = PHYGetLongRAMAddr(0x300) + 2;
                        if(RxBuffer[0]< (unsigned) RX_PACKET_SIZE)
                        {   
                            //indicate that data is now stored in the buffer
                            MRF24J40Status.bits.RX_BUFFERED = 1;
                            
                            //copy all of the data from the FIFO into the TxBuffer, plus RSSI and LQI
                            for(i=1;i<=RxBuffer[0]+2;i++)
                            {
                                RxBuffer[i] = PHYGetLongRAMAddr(0x300+i);
                            }
                            PHYSetShortRAMAddr(WRITE_RXFLUSH, 0x01);
                            
                            ///////////////////////////////////////////////////////////
                            // data has been received so unblock any tasks
                            // waiting on the miwi semaphore (i.e. the MiWi taskitself)
		                    xSemaphoreGiveFromISR(hMiWiSemaphore, &taskWoken);	
                        }
                        else
                        {
                            //else it was a larger packet than we can receive
                            //flush it
                            PHYSetShortRAMAddr(WRITE_RXFLUSH,0x01); 
                        }
    
