span999/span-winceframework/PIC-MPLab/PIC24-Proj/PIC24-FreeRTOS-Demo/src/MRF24J40.c
                        // enable radio to receive next packet
                        PHYSetShortRAMAddr(WRITE_BBREG1, 0x00);
                    }
                    else
                    {
                        //else if the RX is not enabled then we need to flush this packet
                        //flush the buffer
                        PHYSetShortRAMAddr(WRITE_RXFLUSH,0x01);
                        #if defined(ENABLE_SECURITY)
                            MRF24J40Status.bits.RX_SECURITY = 0;
                            #if !defined(TARGET_SMALL)
                                MRF24J40Status.bits.RX_IGNORE_SECURITY = 0;
                            #endif
                        #endif
                    }//end of RX_BUFFERED check
                        
                } //end of RXIF check
                
START_OF_SEC_INT:                
                if( flags.bits.SECIF )
                {
                    #ifdef ENABLE_SECURITY
                        BYTE FrameControl;
                        if( MRF24J40Status.bits.TX_BUSY )
                        {
                            MRF24J40Status.bits.RX_IGNORE_SECURITY = 1;
                            PHYSetShortRAMAddr(WRITE_SECCR0, 0x80);
                            PHYSetShortRAMAddr(WRITE_RXFLUSH,0x01);
                            goto END_OF_RF_INT;
                        }
                        
                        #ifndef TARGET_SMALL
                            
                            // all the code below is to check the key sequence
                            // number
                            
                            i = 6;
                            FrameControl = PHYGetLongRAMAddr(0x301);
                            if( (FrameControl & 0x40) == 0 ) // intra PAN?
                            {
                                i += 2;
                            }
                            
                            FrameControl = PHYGetLongRAMAddr(0x302);
                            if( (FrameControl & 0x0C) == 0x0C )
                            {
                                i += 8;
                            }
                            else
                            {
                                i += 2;
                            }
                            
                            // wait until the key sequence number is available
                            for(j = 0; j < i + 10; j++)
                            {
                                PHYGetLongRAMAddr(0x301+j);
                            }
                            
                            // get key sequence number
                            j = PHYGetLongRAMAddr(0x30C + i);
    
                            if( j != myKeySequenceNumber )
                            {
                                PHYSetShortRAMAddr(WRITE_SECCR0, 0x80); // ignore the packet
                                MRF24J40Status.bits.RX_IGNORE_SECURITY = 1;
                            }

                            if( MRF24J40Status.bits.RX_IGNORE_SECURITY == 0 )
                        #endif
                        {
                            // supply the key
                            for(i = 0; i < 16; i++)
                            {
                                PHYSetLongRAMAddr(0x2B0 + i, mySecurityKey[i]);
                            }
                            MRF24J40Status.bits.RX_SECURITY = 1;
    
                            // set security level and trigger the decryption
                            PHYSetShortRAMAddr(WRITE_SECCR0, mySecurityLevel << 3 | 0x40);
                        }
                    #else
                        PHYSetShortRAMAddr(WRITE_SECCR0, 0x80); // ignore the packet
                        //MRF24J40Status.bits.RX_IGNORE_SECURITY = 1;
                    #endif 
                }                
            } //end of scope of RF interrupt handler
        } //end of if(RFIE && RFIF)

END_OF_RF_INT:        
        #if defined(__18CXX)
            //check to see if the symbol timer overflowed
            if(INTCONbits.TMR0IF)
            {
                if(INTCONbits.TMR0IE)
                {
                    /* there was a timer overflow */
                    INTCONbits.TMR0IF = 0;
                    timerExtension1++;
                    if(timerExtension1 == 0u)
                    {
                        timerExtension2++;
                    }
                }
            }
            
            if(INTCONbits.RBIE && INTCONbits.RBIF)
            {
                INTCONbits.RBIF = 0;
            }
        #endif

 	    // this macro will allow a higher priority task than the one originally
	    // interrupted to be woken after servicing the interrupt
	    portEND_SWITCHING_ISR(taskWoken);		

        return;
        
    } //end of interrupt handler
    
    
    
    #if defined(__18CXX)
        #pragma code highVector=0x08
        void HighVector (void)
        {
            _asm goto HighISR _endasm
        }
        #pragma code /* return to default code section */
        
        #pragma code lowhVector=0x18
        void LowVector (void)
        {
            _asm goto HighISR _endasm
        }
        #pragma code /* return to default code section */
    #endif

#else

    /*******************************************************************
     * C18 compiler cannot compile an empty C file. define following 
     * bogus variable to bypass the limitation of the C18 compiler if
     * a different transceiver is chosen.
     ******************************************************************/
    extern char bogusVariable;
#endif

